{
  "catalogo": {
    "serieTV": {
      "sandman": {
        "title": "The Sandman",
        "sinossiBreve": "Un dio del sogno intraprende un viaggio tra i mondi per recuperare ciò che gli è stato rubato e restaurare il suo regno. Basato sui fumetti di Neil Gaiman.",
        "sinossiLunga": "Nel 1916, Morfeo, uno dei sette Eterni, viene catturato durante un rituale occulto da Roderick Burgess, un mago che mirava a catturare Morte per riportare in vita suo figlio, caduto in battaglia. Morfeo rimane prigioniero per 105 anni. Una volta evaso, intraprende un viaggio attraverso mondi diversi per ristabilire l'ordine nel suo regno e recuperare i suoi oggetti di potere: l'elmo, il rubino e la sabbia. La trama esplora il rapporto tra il mondo reale e il mondo dei sogni, concentrandosi anche sulle persone comuni che si trovano coinvolte negli eventi sovrannaturali. La serie affronta temi come la famiglia, la responsabilità, il potere e le conseguenze delle proprie azioni, sia nel mondo dei vivi che in quello dei sogni.",
        "immagine": "../IMMAGINI/SerieTV/sandman.jpg",
        "trailer": "../VIDEO/SerieTV/TheSandman.mp4",
        "episodi": [
          "Episodio1 - Il Sogno",
          "Episodio2 - La Realtà",
          "Episodio3 - Il Viaggio",
          "Episodio4 - La Confronto"
        ]
      },
      "squid_game": {
        "title": "Squid Game",
        "sinossiBreve": "Centinaia di persone con problemi economici accettano un invito a competere in giochi per bambini, ma con poste in gioco mortali.",
        "sinossiLunga": "Squid Game è un thriller sudcoreano in cui centinaia di persone disperate e indebitate partecipano a giochi per bambini con posta in gioco la vita. Gi-hun, il protagonista, si unisce per i soldi, affrontando giochi mortali e la brutalità umana. La serie è una critica sociale sulla disuguaglianza e la disperazione, mostrando fin dove ci si spinge per la sopravvivenza.",
        "immagine": "../IMMAGINI/SerieTV/squid_game.jpg",
        "trailer": "../VIDEO/SerieTV/SquidGame.mp4",
        "episodi": [
          "Episodio1 - Il Gioco Inizia",
          "Episodio2 - Il Primo Gioco",
          "Episodio3 - Il Gioco della Carta",
          "Episodio4 - Il Gioco del Polpo"
        ]
      },
      "stranger_things": {
        "title": "Stranger Things",
        "sinossiBreve": "Quando un ragazzino scompare, i suoi amici, la madre e il capo della polizia sono coinvolti in un terrificante mistero che coinvolge esperimenti governativi segreti, forze soprannaturali e una strana ragazzina.",
        "sinossiLunga": "Stranger Things è una serie sci-fi/horror ambientata negli anni '80 a Hawkins, Indiana. Inizia con la scomparsa di Will Byers, che porta i suoi amici (Mike, Dustin, Lucas) e la sua famiglia (Joyce, Jonathan) a scoprire l'esistenza di una ragazza con poteri, Undici, e di una dimensione parallela oscura, il Sottosopra. La serie è un mix di amicizia, mistero e lotta contro forze soprannaturali, con un'atmosfera nostalgica.",
        "immagine": "../IMMAGINI/SerieTV/stranger_things.jpg",
        "trailer": "../VIDEO/SerieTV/StrangerThings.mp4",
        "episodi": [
          "Episodio1 - La Scomparsa",
          "Episodio2 - Il Sottosopra",
          "Episodio3 - La Ragazza con i Poteri",
          "Episodio4 - La Lotta contro il Male"
        ]
      },
      "tenebre_e_ossa": {
        "title": "Tenebre e Ossa",
        "sinossiBreve": "Una giovane cartografa orfana scopre di avere un potere straordinario che potrebbe liberare il suo paese da una minaccia oscura, ma dovrà affrontare forze pericolose.",
        "sinossiLunga": "Tenebre e Ossa è una serie fantasy ambientata nel Grishaverse, un mondo diviso da un'oscura Faglia d'Ombra. La trama segue Alina Starkov, un'orfana che scopre di essere una Grisha con il potere di evocare la luce, l'unica speranza per distruggere la Faglia. Sotto la guida dell'enigmatico Generale Kirigan, Alina si addestra tra intrighi e pericoli. La serie è un'avventura di magia, destino e lotta contro l'oscurità.",
        "immagine": "../IMMAGINI/SerieTV/tenebre_e_ossa.jpg",
        "trailer": "../VIDEO/SerieTV/Tenebre&Ossa.mp4",
        "episodi": [
          "Episodio1 - La Luce",
          "Episodio2 - L'Ombra",
          "Episodio3 - Il Potere",
          "Episodio4 - La Battaglia"
        ]
      },
      "you": {
        "title": "You",
        "sinossiBreve": "Un manager di librerie ossessivo e brillante usa Internet e i social media per entrare nella vita delle persone di cui si innamora.",
        "sinossiLunga": "Joe, un libraio a New York, trasforma questa ossessione in una serie di azioni violente e manipolative, arrivando anche a commettere omicidi per eliminare gli ostacoli percepiti nella sua relazione.La serie, narrata dalla prospettiva di Joe, esplora il fenomeno dello stalking e le giustificazioni che lui utilizza per i suoi comportamenti, spesso considerati disturbati. Nelle varie stagioni, Joe si trasferisce da New York a Los Angeles e poi in un'altra città, sempre alla ricerca dell'amore e sempre con lo stesso schema: ossessione, stalking, e, infine, violenza. Ogni stagione presenta un nuovo interesse amoroso e un nuovo scenario, ma il ciclo di comportamento ossessivo-compulsivo di Joe rimane costante.",
        "immagine": "../IMMAGINI/SerieTV/you.jpg",
        "trailer": "../VIDEO/SerieTV/You.mp4",
        "episodi": [
          "Episodio1 - L'Inizio",
          "Episodio2 - La Scoperta",
          "Episodio3 - La Verità",
          "Episodio4 - La Fine"
        ]
      },
      "after_life": {
        "title": "After Life",
        "sinossiBreve": "Un giornalista locale lotta per affrontare la morte improvvisa della moglie, decidendo di vivere la vita facendo esattamente ciò che vuole.",
        "sinossiLunga": "After Life è una serie comedy-drama che segue Tony, un giornalista distrutto dalla morte della moglie. Decide di vivere senza filtri, dicendo ciò che pensa, ma il suo cinismo viene gradualmente sfidato dalla gentilezza inaspettata di chi lo circonda. La serie è un'agrodolce esplorazione del lutto, dell'amicizia e della riscoperta del significato della vita.",
        "immagine": "../IMMAGINI/SerieTV/after_life.jpg",
        "trailer": "../VIDEO/SerieTV/After-Life.mp4",
        "episodi": [
          "Episodio1 - Il Dolore",
          "Episodio2 - La Rabbia",
          "Episodio3 - La Speranza",
          "Episodio4 - La Guarigione"
        ]
      },
      "breaking_bad": {
        "title": "Breaking Bad",
        "sinossiBreve": "Un professore di chimica del liceo con il cancro ai polmoni si trasforma in un produttore di metanfetamina per assicurare il futuro finanziario della sua famiglia.",
        "sinossiLunga": "Breaking Bad segue Walter White, un professore di chimica che, diagnosticato con un cancro, inizia a produrre metanfetamina con il suo ex studente Jesse Pinkman per assicurare il futuro della famiglia. La serie narra la sua discesa nel mondo criminale, trasformandolo da uomo mite nel temuto Heisenberg, esplorando il degrado morale e le conseguenze distruttive del potere.",
        "immagine": "../IMMAGINI/SerieTV/breaking_bad.webp",
        "trailer": "../VIDEO/SerieTV/BreakingBad.mp4",
        "episodi": [
          "Episodio1 - La Fuga",
          "Episodio2 - La Vendetta",
          "Episodio3 - La Caduta",
          "Episodio4 - La Resurrezione"
        ]
      },
      "dexter": {
        "title": "Dexter",
        "sinossiBreve": "Di giorno analista di schizzi di sangue per la polizia, di notte serial killer che prende di mira altri assassini.",
        "sinossiLunga": "Dexter Morgan è un analista forense di Miami con una doppia vita: è un serial killer che uccide solo altri assassini sfuggiti alla giustizia, seguendo il \"Codice di Harry\". La serie bilancia la sua facciata normale con la sua inarrestabile \"Oscura Mamma\", esplorando moralità, giustizia e la natura del male.",
        "immagine": "../IMMAGINI/SerieTV/dexter.webp",
        "trailer": "../VIDEO/SerieTV/Dexter.mp4",
        "episodi": [
          "Episodio1 - La Morte",
          "Episodio2 - Il Gioco",
          "Episodio3 - La Vendetta",
          "Episodio4 - La Fuga"
        ]
      },
      "dark": {
        "title": "Dark",
        "sinossiBreve": "Dopo la scomparsa di un bambino nella città di Winden, le vite di quattro famiglie si intrecciano in un'indagine che svela segreti e misteri legati a un'intricata rete di viaggi nel tempo.",
        "sinossiLunga": "Una serie misteriosa e complessa che ruota attorno alla scomparsa di un bambino nella cittadina tedesca di Winden. La ricerca fa emergere i segreti di quattro famiglie interconnesse, svelando un intricato enigma di viaggi nel tempo che si estende su diverse generazioni e mette in discussione il concetto di libero arbitrio.",
        "immagine": "../IMMAGINI/SerieTV/dark.jpg",
        "trailer": "../VIDEO/SerieTV/DARK.mp4",
        "episodi": [
          "Episodio1 - La Luce",
          "Episodio2 - L'Ombra",
          "Episodio3 - Il Potere",
          "Episodio4 - La Battaglia"
        ]
      },
      "lost": {
        "title": "Lost",
        "sinossiBreve": "I sopravvissuti a un disastro aereo si ritrovano bloccati su un'isola misteriosa, piena di creature e segreti.",
        "sinossiLunga": "Lost inizia con lo schianto del volo 815 su un'isola misteriosa. I sopravvissuti, guidati da Jack, Kate e Locke, scoprono che l'isola è piena di segreti e pericoli inspiegabili. Tra flashback e misteri, la serie esplora temi come la sopravvivenza, il destino e le connessioni tra i personaggi, tenendo gli spettatori con il fiato sospeso.",
        "immagine": "../IMMAGINI/SerieTV/lost.webp",
        "trailer": "../VIDEO/SerieTV/Lost.mp4",
        "episodi": [
          "Episodio1 - La Fuga",
          "Episodio2 - La Vendetta",
          "Episodio3 - La Caduta",
          "Episodio4 - La Resurrezione"
        ]
      }
    },
    "films": {
      "arrival": {
        "title": "Arrival",
        "sinossiBreve": "Una linguista viene reclutata dall'esercito per comunicare con gli alieni che sono atterrati sulla Terra e scoprire le loro intenzioni.",
        "sinossiLunga": "Arrival racconta la storia di Louise Banks, una rinomata linguista, che viene reclutata dall'esercito americano quando dodici misteriose navicelle aliene atterrano in diverse parti del mondo. Il suo compito è cercare di comunicare con gli alieni, noti come eptapodi, per capire le loro intenzioni e se rappresentano una minaccia per l'umanità. Mentre lavora alla decifrazione del linguaggio alieno, Louise inizia ad avere strane visioni del futuro, che si rivelano essere legate alla sua interazione con gli eptapodi e alla loro lingua.",
        "immagine": "../IMMAGINI/Film/arrival.webp",
        "trailer": "../VIDEO/Films/Arrival.mp4"
      },
      "gran_torino": {
        "title": "Gran Torino",
        "sinossiBreve": "Un veterano della guerra di Corea razzista si ritrovato a confrontarsi con i suoi pregiudizi quando i suoi vicini di casa, una famiglia Hmong, lo spingono fuori dalla sua zona di comfort.",
        "sinossiLunga": "\"Gran Torino\" è un film del 2008 diretto e interpretato da Clint Eastwood. Racconta la storia di Walt Kowalski, un veterano della guerra di Corea, burbero e razzista, che vive in un quartiere dominato da immigrati Hmong. Dopo la morte della moglie, Walt si ritrova solo e in conflitto con i suoi figli. Il suo unico vero amore è la sua Ford Gran Torino del 1972. Quando il giovane vicino Thao tenta di rubargliela, spinto da una gang locale, Walt si troverà a difendere lui e la sua famiglia, superando i propri pregiudizi e instaurando un inaspettato rapporto di amicizia e protezione. Il film esplora temi di redenzione, razzismo, famiglia e la ricerca di significato nella vecchiaia.",
        "immagine": "../IMMAGINI/Film/gran_torino.webp",
        "trailer": "../VIDEO/Films/GranTorino.mp4"
      },
      "oppeneimer": {
        "title": "Oppenheimer",
        "sinossiBreve": "Il film racconta la storia di J. Robert Oppenheimer, il fisico teorico che fu a capo del Laboratorio di Los Alamos durante il Progetto Manhattan e viene accreditato come \"padre della bomba atomica\".",
        "sinossiLunga": "Oppenheimer è il dramma biografico di J. Robert Oppenheimer, il fisico che diresse il Progetto Manhattan per creare la bomba atomica. Il film esplora il suo complesso percorso, dalla brillante ascesa scientifica alle tormentate implicazioni morali della sua invenzione.La narrazione si sviluppa tra la frenesia della costruzione della bomba a Los Alamos e le successive battaglie legali e politiche post-belliche che minacciarono la sua reputazione. Il film mostra il profondo conflitto interiore di Oppenheimer, diviso tra il trionfo scientifico e l'orrore della distruzione che ha scatenato.",
        "immagine": "../IMMAGINI/Film/oppenheimer.webp",
        "trailer": "../VIDEO/Films/OPPENHEIMER.mp4"
      },
      "interstellar": {
        "title": "Interstellar",
        "sinossiBreve": "Un gruppo di esploratori si avventura attraverso un wormhole nel tentativo di garantire la sopravvivenza dell'umanità.",
        "sinossiLunga": "Interstellar è un'odissea fantascientifica ambientata in una Terra morente. Cooper, un ex pilota, intraprende un disperato viaggio attraverso un wormhole per trovare un nuovo pianeta abitabile, ultima speranza per l'umanità.La missione lo porta ad affrontare la dilatazione del tempo e i pericoli dei buchi neri, mentre il legame con sua figlia Murph lo spinge a lottare contro le enormi distanze. Il film è una profonda riflessione sulla scienza, l'amore e il sacrificio, esplorando la nostra posizione nell'universo",
        "immagine": "../IMMAGINI/Film/interstellar.webp",
        "trailer": "../VIDEO/Films/Interstellar.mp4"
      },
      "split": {
        "title": "Split",
        "sinossiBreve": "Un uomo con 23 diverse personalità rapirà tre ragazze, che dovranno trovare un modo per scappare prima che appaia la sua 24ª personalità, \"La Bestia\".",
        "sinossiLunga": "Split è un thriller psicologico su Kevin, un uomo con 23 personalità che ne sviluppa una ventiquattresima e mostruosa, \"La Bestia\". Quando rapisce tre ragazze, tra cui l'astuta Casey, le prigioniere devono confrontarsi con le sue molteplici identità per sopravvivere. Il film è un'esplorazione inquietante del trauma e della resilienza umana.",
        "immagine": "../IMMAGINI/Film/split.webp",
        "trailer": "../VIDEO/Films/SPLIT.mp4"
      }
    }
  },
  "users": [
    {
      "id": 1,
      "name": "Luca",
      "email": "lucapende@gmail.com",
      "password": "ciao123",
      "logo": "../IMMAGINI/Avatar/avatar.png"
    },
    {
      "id": 2,
      "name": "Cristina",
      "email": "ttommaso938@gmail.com",
      "password": "OggièLunedi123!",
      "logo": "../IMMAGINI/Avatar/avatar3.jpg"
    },
    {
      "id": 3,
      "name": "Mario",
      "email": "lucapende@gmail.com",
      "password": "OggièLunedi123!",
      "logo": "../IMMAGINI/Avatar/avatar.png"
    },
    {
      "id": 4,
      "name": "Sara",
      "email": "ttommaso938@gmail.com",
      "password": "Lunedi123!",
      "logo": "../IMMAGINI/Avatar/avatar3.jpg"
    }
  ]
}